УТ_для_edt/src/Documents/смартОтражениеОстатковНоменклатурыСОХ/смартОтражениеОстатковНоменклатурыСОХ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>смартОтражениеОстатковНоменклатурыСОХ</name>
  <comment>#Б1226 смарт: Шляпников 25.10.2024 / Интеграция с WMS. Загрузка и хранение данных об остатках складов отв. хранения</comment>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьРасхождение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Исключить</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>АртикулКодПоДаннымСклада</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НоменклатураПоДаннымСклада</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СерияПоДаннымСклада</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РучноеСопоставление</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУчет</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоФакт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомераСтрокФайла</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

УТ_для_edt/src/AccumulationRegisters/ТоварыНаСкладах/ТоварыНаСкладах.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ТоварыНаСкладах</name>
  <resources>
    <name>ВНаличии</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КОтгрузке</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>КонтролироватьОстатки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Назначение</name>
    <type>
      <types>CatalogRef.Назначения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Помещение</name>
    <type>
      <types>CatalogRef.СкладскиеПомещения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Серия</name>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

УТ_для_edt/src/Catalogs/СерииНоменклатуры/СерииНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СерииНоменклатуры</name>
  <attributes>
    <name>ГоденДо</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидНоменклатуры</name>
    <type>
      <types>CatalogRef.ВидыНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>Номер</name>
    <type>
      <types>DefinedType.НомерСерии</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерКиЗГИСМ</name>
    <type>
      <types>DefinedType.НомерКиЗГИСМ</types>
    </type>
  </attributes>
  <attributes>
    <name>RFIDTID</name>
    <type>
      <types>DefinedType.RFIDTID</types>
    </type>
  </attributes>
  <attributes>
    <name>RFIDUser</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>RFIDEPC</name>
    <type>
      <types>DefinedType.RFIDEPC</types>
    </type>
  </attributes>
  <attributes>
    <name>EPCGTIN</name>
    <type>
      <types>DefinedType.GTIN</types>
    </type>
  </attributes>
  <attributes>
    <name>RFIDМеткаНеЧитаемая</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПроизводства</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроизводительЕГАИС</name>
    <type>
      <types>CatalogRef.КлассификаторОрганизацийЕГАИС</types>
    </type>
  </attributes>
  <attributes>
    <name>Справка2ЕГАИС</name>
    <type>
      <types>CatalogRef.Справки2ЕГАИС</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроизводительВЕТИС</name>
    <type>
      <types>CatalogRef.ПредприятияВЕТИС</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаписьСкладскогоЖурналаВЕТИС</name>
    <type>
      <types>CatalogRef.ЗаписиСкладскогоЖурналаВЕТИС</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПартииВЕТИС</name>
    <type>
      <types>DefinedType.СтрокаВЕТИС</types>
    </type>
  </attributes>
  <attributes>
    <name>МаксимальнаяРозничнаяЦенаМОТП</name>
    <comment>Максимальная розничная цена (МОТП)</comment>
    <type>
      <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>смартСтатусПроверкиОборудования</name>
    <comment>++ #1250 Фролов 17.11.2022 //Проверенное оборудование. &quot;Запрет на отгрузку без проверки оборудования  #1143 &quot;</comment>
    <type>
      <types>EnumRef.смартСтатусыПроверкиОборудованияПоСерии</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>смартДанныеУпаковочногоЛиста</name>
    <comment>//++ #Б1140 смарт: Шляпников 02.09.2025 / Учет данных по упаковочным листам.</comment>
    <attributes>
      <name>ТипУпаковки</name>
      <type>
        <types>EnumRef.смартТипыУпаковокУпаковочногоЛиста</types>
      </type>
    </attributes>
    <attributes>
      <name>Длина</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Ширина</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Высота</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Вес</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Объем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Хрупкое</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УТ_для_edt/src/Documents/смартОтражениеОстатковНоменклатурыСОХ/Forms/ФормаДокумента/Module.bsl
#Область ОписаниеПеременных

&НаКлиенте
Перем ПараметрыДляЗаписи Экспорт;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;

	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(Объект, ЭтотОбъект);

	Если Параметры.Ключ.Пустая() Тогда
		Объект.Автор = Пользователи.АвторизованныйПользователь();
	КонецЕсли;
	
	// Обработчик механизма "ВерсионированиеОбъектов"
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборот.ПриСозданииНаСервере(ЭтаФорма);
	// Конец ИнтеграцияС1СДокументооборотом

	СобытияФорм.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
	
	ОбновитьИнформациюОРасхожденииПоСтрокамДокумента();
	
	УстановитьОтборТабличнойЧастиТовары();
	
	РассчитатьИтоги();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)

	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	ПриЧтенииСозданииНаСервере();

	МодификацияКонфигурацииПереопределяемый.ПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)

	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	МодификацияКонфигурацииПереопределяемый.ПослеЗаписиНаСервере(ЭтаФорма, ТекущийОбъект, ПараметрыЗаписи);
	
	ОбновитьИнформациюОРасхожденииПоСтрокамДокумента();
	
	УстановитьОтборТабличнойЧастиТовары();
	
	РассчитатьИтоги();
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	МодификацияКонфигурацииКлиентПереопределяемый.ПослеЗаписи(ЭтаФорма, ПараметрыЗаписи);
	
	ОбщегоНазначенияУТКлиент.ВыполнитьДействияПослеЗаписи(ЭтаФорма, Объект, ПараметрыЗаписи);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("СтандартныеПодсистемы.ПодключаемыеКоманды") Тогда
		МодульПодключаемыеКомандыКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиент");
		МодульПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СкладПриИзменении(Элемент)
	
	Если Объект.Товары.Количество() > 0 Тогда
		ПоказатьВопрос(Новый ОписаниеОповещения("ПересчитатьУчетноеКоличествоВыборПользователя", ЭтаФорма), 
												"Пересчитать учетное количество ?", РежимДиалогаВопрос.ДаНет);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	Если Объект.Товары.Количество() > 0 Тогда
		ПоказатьВопрос(Новый ОписаниеОповещения("ПересчитатьУчетноеКоличествоВыборПользователя", ЭтаФорма), 
												"Пересчитать учетное количество ?", РежимДиалогаВопрос.ДаНет);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ОчиститьСообщения();
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура ЗагрузитьДанныеИзФайлаПодтверждение(Значение, ДопПараметры) Экспорт
	
	Если Значение = КодВозвратаДиалога.Да Тогда
		ЗагрузитьДанныеИзФайлаКлиент();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьДанныеИзФайлаКлиентВыборФайлаЗавершение(ИмяФайла, ДопПараметры) Экспорт
	
	Если ТипЗнч(ИмяФайла) = Тип("Массив") И ИмяФайла.Количество() > 0 Тогда
		
		Данные = Новый ДвоичныеДанные(ИмяФайла[0]);
		АдресДанных = ПоместитьВоВременноеХранилище(Данные, УникальныйИдентификатор);
		ЗагрузитьДанныеИзФайлаСервер(АдресДанных);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьУчетноеКоличествоВыборПользователя(Значение, ДопПараметры) Экспорт
	
	Если Значение = КодВозвратаДиалога.Да Тогда
		ЗаполнитьУчетноеКоличество();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТовары

&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)
	
	ПроверитьОчиститьСерию(Элементы.Товары.ТекущаяСтрока);
	
	ЗаполнитьУчетноеКоличество(Элементы.Товары.ТекущиеДанные.НомерСтроки);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСерияПриИзменении(Элемент)
	
	ЗаполнитьУчетноеКоличество(Элементы.Товары.ТекущиеДанные.НомерСтроки);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСерияНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ВидНоменклатуры = ПолучитьВладельцаСерий(Элементы.Товары.ТекущиеДанные.Номенклатура);
	ОткрытьФорму("Справочник.СерииНоменклатуры.ФормаВыбора", Новый Структура("ВидНоменклатуры", ВидНоменклатуры), Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	РассчитатьИтоги();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗагрузитьДанныеИзФайла(Команда)
	
	Если Объект.Товары.Количество() > 0 Тогда
		ПоказатьВопрос(Новый ОписаниеОповещения("ЗагрузитьДанныеИзФайлаПодтверждение",ЭтаФорма),
						"Табличная часть документа будет очищена. Продолжить ?", РежимДиалогаВопрос.ДаНет);
	Иначе
		ЗагрузитьДанныеИзФайлаКлиент();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказыватьТолькоРасхождения(Команда)
	ПоказыватьТолькоРасхожденияНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьУчетноеКоличествоКоманда(Команда)
	
	Если Объект.Товары.Количество() > 0 Тогда
		ПоказатьВопрос(Новый ОписаниеОповещения("ПересчитатьУчетноеКоличествоВыборПользователя", ЭтаФорма), 
												"Учетное количество будет перезаполнено. Продолжить ?", РежимДиалогаВопрос.ДаНет);
	Иначе
		ЗаполнитьУчетноеКоличество();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьСтроку(Команда)
	
	Если Элементы.Товары.ВыделенныеСтроки <> Неопределено Тогда
		
		МассивУдаляемыхСтрок = Новый Массив;
		Для каждого ТекущаяСтрока Из Элементы.Товары.ВыделенныеСтроки Цикл
			МассивУдаляемыхСтрок.Добавить(Объект.Товары.НайтиПоИдентификатору(ТекущаяСтрока));
		КонецЦикла;
		
		Для каждого стрМассивУдаляемыхСтрок Из МассивУдаляемыхСтрок Цикл
			Объект.Товары.Удалить(стрМассивУдаляемыхСтрок);
		КонецЦикла;
		
		РассчитатьИтоги();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьДанныеССервераАдмирал(Команда)
	ЗагрузитьДанныеССервераАдмиралНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПриЧтенииСозданииНаСервере()
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьДанныеИзФайлаКлиент()
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Фильтр = "Excel|*.xlsx";
	Диалог.Показать(Новый ОписаниеОповещения("ЗагрузитьДанныеИзФайлаКлиентВыборФайлаЗавершение",ЭтаФорма));
	
КонецПроцедуры

&НаСервере
Процедура ПоказыватьТолькоРасхожденияНаСервере()
	
	Элементы.ТоварыПоказыватьТолькоРасхождения.Пометка = НЕ Элементы.ТоварыПоказыватьТолькоРасхождения.Пометка;
	УстановитьОтборТабличнойЧастиТовары();
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказыватьИсключенные(Команда)
	
	Элементы.ТоварыПоказыватьИсключенные.Пометка = НЕ Элементы.ТоварыПоказыватьИсключенные.Пометка;
	УстановитьОтборТабличнойЧастиТовары();
	
КонецПроцедуры

#КонецОбласти

#Область Прочее

&НаСервере
Функция ПолучитьТаблицуДляЗагрузкиДанных()
	
	КолонкиВыгрузки = "АртикулКодПоДаннымСклада,НоменклатураПоДаннымСклада,СерияПоДаннымСклада,КоличествоФакт,НомераСтрокФайла";
	ТЗФайла = Документы.смартОтражениеОстатковНоменклатурыСОХ.ПустаяСсылка().Товары.Выгрузить(, КолонкиВыгрузки);
	
	Возврат ТЗФайла;
	
КонецФункции

&НаСервере
Процедура ЗагрузитьДанныеИзФайлаСервер(АдресДанных)
	
	Объект.Товары.Очистить();
	
	Данные = ПолучитьИзВременногоХранилища(АдресДанных);
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла("xlsx");
	Данные.Записать(ИмяВременногоФайла);
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.Прочитать(ИмяВременногоФайла, СпособЧтенияЗначенийТабличногоДокумента.Значение);
	Удалитьфайлы(ИмяВременногоФайла);
	
	ТЗФайла = ПолучитьТаблицуДляЗагрузкиДанных();
	
	Для каждого стрОбласть Из ТабДокумент.Области Цикл
		
		СтраницаДокумента = ТабДокумент.ПолучитьОбласть(стрОбласть.Имя);
		
		Для н = 2 По СтраницаДокумента.ВысотаТаблицы Цикл
			
			АртикулКодПоДаннымСклада = СокрЛП(СтраницаДокумента.Область(н, 2, н, 2).Текст);
			Если ЗначениеЗаполнено(АртикулКодПоДаннымСклада) Тогда
				
				СерияПоДаннымСклада = СокрЛП(СтраницаДокумента.Область(н, 4, н, 4).Текст);
				НайденныеСтроки = ТЗФайла.НайтиСтроки(Новый Структура("АртикулКодПоДаннымСклада, СерияПоДаннымСклада", АртикулКодПоДаннымСклада, СерияПоДаннымСклада));
				
				Если НайденныеСтроки.Количество() > 0 Тогда
					НоваяСтрока = НайденныеСтроки[0];
					НоваяСтрока.НомераСтрокФайла = СтрШаблон("%1, %2", НоваяСтрока.НомераСтрокФайла, Формат(н, "ЧГ="));
				Иначе
					НоваяСтрока = ТЗФайла.Добавить();
					НоваяСтрока.НомераСтрокФайла = Формат(н, "ЧГ=");
				КонецЕсли;
			
				НоваяСтрока.АртикулКодПоДаннымСклада = АртикулКодПоДаннымСклада;
				НоваяСтрока.НоменклатураПоДаннымСклада = СокрЛП(СтраницаДокумента.Область(н, 3, н, 3).Текст);
				НоваяСтрока.СерияПоДаннымСклада = СерияПоДаннымСклада;
				НоваяСтрока.КоличествоФакт = НоваяСтрока.КоличествоФакт + 
											 СтроковыеФункцииКлиентСервер.СтрокаВЧисло(СтраницаДокумента.Область(н, 6, н, 6).Текст);
				
			Иначе
				Прервать;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	ЗагрузитьДанныеОбработатьПолученнуюТаблицу(ТЗФайла);
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьДанныеОбработатьПолученнуюТаблицу(ТЗСДанымиДляЗагрузки)

	МассивВидовНоменклатуры = ПолучитьМассивВидовНоменклатурыСУчетомПоСериям();
	ТаблицаПользовательскихСоответствий = ПолучитьПользовательскиеСоответствия(ТЗСДанымиДляЗагрузки);
	
	Для каждого стрТЗФайла Из ТЗСДанымиДляЗагрузки Цикл
		
		НоваяСтрока = Объект.Товары.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, стрТЗФайла);
		
		ПользовательскоеСоответствие = ТаблицаПользовательскихСоответствий.НайтиСтроки(Новый Структура("АртикулКодПоДаннымСклада", стрТЗФайла.АртикулКодПоДаннымСклада));
		НоваяСтрока.Исключить = ПользовательскоеСоответствие[0].Исключить;
		
		Если ПользовательскоеСоответствие[0].РучноеСопоставление Тогда
			
			НоваяСтрока.РучноеСопоставление = ПользовательскоеСоответствие[0].РучноеСопоставление;
			НоваяСтрока.Номенклатура = ПользовательскоеСоответствие[0].Номенклатура;
			НоваяСтрока.Серия = ПользовательскоеСоответствие[0].Серия;
			
		Иначе
		
			МассивКодАртикул = СтрРазделить(стрТЗФайла.АртикулКодПоДаннымСклада, ".", Истина);
			Если МассивКодАртикул.Количество() = 1 Тогда
				НоваяСтрока.Номенклатура = НайтиНоменклатуруПоКодуИлиАртикулу(МассивКодАртикул[0]);
			ИначеЕсли МассивКодАртикул.Количество() = 2 Тогда
				НоваяСтрока.Номенклатура = НайтиНоменклатуруПоКодуИлиАртикулу(МассивКодАртикул[0], МассивКодАртикул[1]);
			Иначе
				КодДляПоиска = МассивКодАртикул[МассивКодАртикул.Количество() - 1];
				АртикулДляПоиска = Лев(стрТЗФайла.АртикулКодПоДаннымСклада, СтрДлина(стрТЗФайла.АртикулКодПоДаннымСклада) - СтрДлина(КодДляПоиска) - 1);
				НоваяСтрока.Номенклатура = НайтиНоменклатуруПоКодуИлиАртикулу(АртикулДляПоиска, КодДляПоиска);
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(НоваяСтрока.Номенклатура) И ЗначениеЗаполнено(ПользовательскоеСоответствие[0].Номенклатура) Тогда
				НоваяСтрока.Номенклатура = ПользовательскоеСоответствие[0].Номенклатура;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(НоваяСтрока.Номенклатура) И ЗначениеЗаполнено(НоваяСтрока.СерияПоДаннымСклада) 
				 И МассивВидовНоменклатуры.Найти(НоваяСтрока.Номенклатура.ВидНоменклатуры) <> Неопределено Тогда
				 
				НоваяСтрока.Серия = НайтиСериюНоменклатуры(НоваяСтрока.Номенклатура, НоваяСтрока.СерияПоДаннымСклада);
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	ЗаполнитьУчетноеКоличество();
	
	КоличествоСтрок = Объект.Товары.Количество();
	КоличествоУдаленныхСтрок = 0;
	НумераторСтрок = 0;
	Пока НумераторСтрок < КоличествоСтрок - КоличествоУдаленныхСтрок - 1 Цикл
		
		стрТовары = Объект.Товары[НумераторСтрок];
		 
		Если МассивВидовНоменклатуры.Найти(стрТовары.Номенклатура.ВидНоменклатуры) = Неопределено Тогда
			
			НайденныеСтроки = Объект.Товары.НайтиСтроки(Новый Структура("АртикулКодПоДаннымСклада,Номенклатура",
																		 стрТовары.АртикулКодПоДаннымСклада, стрТовары.Номенклатура));
			МассивСерий = Новый Массив;
			Если ЗначениеЗаполнено(стрТовары.СерияПоДаннымСклада) Тогда
			 	МассивСерий.Добавить(стрТовары.СерияПоДаннымСклада);
			КонецЕсли;
			МассивСтрок = Новый Массив;
			МассивСтрок.Добавить(стрТовары.НомераСтрокФайла);
			 
			Для каждого стрНайденныеСтроки Из НайденныеСтроки Цикл
				
				Если стрНайденныеСтроки <> стрТовары Тогда
					
					стрТовары.КоличествоФакт = стрТовары.КоличествоФакт + стрНайденныеСтроки.КоличествоФакт;
					Если ЗначениеЗаполнено(стрНайденныеСтроки.СерияПоДаннымСклада) Тогда
						МассивСерий.Добавить(стрНайденныеСтроки.СерияПоДаннымСклада);
					КонецЕсли;
					
					Объект.Товары.Удалить(стрНайденныеСтроки);
					КоличествоУдаленныхСтрок = КоличествоУдаленныхСтрок + 1;
					МассивСтрок.Добавить(стрНайденныеСтроки.НомераСтрокФайла);
					
				КонецЕсли;
				
			КонецЦикла;
			
			Если МассивСерий.Количество() > 0 Тогда
				стрТовары.СерияПоДаннымСклада = СтрСоединить(МассивСерий, ", ");
			КонецЕсли;
			стрТовары.НомераСтрокФайла = СтрСоединить(МассивСтрок, ", ");
			
		КонецЕсли;
		
		НумераторСтрок = НумераторСтрок + 1;
		
	КонецЦикла;
	
	ОбновитьИнформациюОРасхожденииПоСтрокамДокумента();
	РассчитатьИтоги();
	Модифицированность = Истина;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьПользовательскиеСоответствия(ТЗФайла)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТЗФайла", ТЗФайла);
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	Запрос.УстановитьПараметр("Дата", Объект.Дата);
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТЗ.АртикулКодПоДаннымСклада КАК АртикулКодПоДаннымСклада
	|ПОМЕСТИТЬ ВТДанныеИзФайла
	|ИЗ
	|	&ТЗФайла КАК ТЗ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТДанныеИзФайла.АртикулКодПоДаннымСклада КАК АртикулКодПоДаннымСклада,
	|	МАКСИМУМ(СОХТовары.Ссылка.Дата) КАК Дата
	|ПОМЕСТИТЬ ВТДатыПоследнихДокументовПоСкладу
	|ИЗ
	|	ВТДанныеИзФайла КАК ВТДанныеИзФайла
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.смартОтражениеОстатковНоменклатурыСОХ.Товары КАК СОХТовары
	|		ПО ВТДанныеИзФайла.АртикулКодПоДаннымСклада = СОХТовары.АртикулКодПоДаннымСклада
	|			И (СОХТовары.Ссылка.Дата <= &Дата)
	|			И (СОХТовары.Ссылка <> &Ссылка)
	|			И (НЕ СОХТовары.Ссылка.ПометкаУдаления)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТДанныеИзФайла.АртикулКодПоДаннымСклада
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТДатыПоследнихДокументовПоСкладу.АртикулКодПоДаннымСклада КАК АртикулКодПоДаннымСклада,
	|	ЕСТЬNULL(смартОтражениеОстатковНоменклатурыСОХТовары.Исключить, ЛОЖЬ) КАК Исключить,
	|	ЕСТЬNULL(смартОтражениеОстатковНоменклатурыСОХТовары.РучноеСопоставление, ЛОЖЬ) КАК РучноеСопоставление,
	|	смартОтражениеОстатковНоменклатурыСОХТовары.Номенклатура КАК Номенклатура,
	|	смартОтражениеОстатковНоменклатурыСОХТовары.Серия КАК Серия
	|ИЗ
	|	ВТДатыПоследнихДокументовПоСкладу КАК ВТДатыПоследнихДокументовПоСкладу
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.смартОтражениеОстатковНоменклатурыСОХ.Товары КАК смартОтражениеОстатковНоменклатурыСОХТовары
	|		ПО ВТДатыПоследнихДокументовПоСкладу.АртикулКодПоДаннымСклада = смартОтражениеОстатковНоменклатурыСОХТовары.АртикулКодПоДаннымСклада
	|			И ВТДатыПоследнихДокументовПоСкладу.Дата = смартОтражениеОстатковНоменклатурыСОХТовары.Ссылка.Дата";
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

&НаСервере
Функция НайтиНоменклатуруПоКодуИлиАртикулу(Артикул = Неопределено, Код = Неопределено)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Данные.Ссылка КАК Ссылка,
	|	Данные.Приоритет КАК Приоритет
	|ИЗ
	|	(ВЫБРАТЬ
	|		Номенклатура.Ссылка КАК Ссылка,
	|		1 КАК Приоритет
	|	ИЗ
	|		Справочник.Номенклатура КАК Номенклатура
	|	ГДЕ
	|		Номенклатура.Код = &Код
	|		И НЕ &Код = НЕОПРЕДЕЛЕНО
	|		И НЕ &Код = """"
	|		И НЕ Номенклатура.ЭтоГруппа
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		Номенклатура.Ссылка,
	|		2
	|	ИЗ
	|		Справочник.Номенклатура КАК Номенклатура
	|	ГДЕ
	|		Номенклатура.Артикул = &Артикул
	|		И НЕ &Артикул = НЕОПРЕДЕЛЕНО
	|		И НЕ &Артикул = """"
	|		И НЕ Номенклатура.ЭтоГруппа) КАК Данные
	|
	|УПОРЯДОЧИТЬ ПО
	|	Приоритет";
	
	КодСПрефиксом = Код;
	Если ЗначениеЗаполнено(Код) Тогда
		ПрефиксацияОбъектовСобытия.УстановитьПрефиксИнформационнойБазы(Справочники.Номенклатура.ПустаяСсылка(), , КодСПрефиксом);
	КонецЕсли;
	Запрос.УстановитьПараметр("Код", КодСПрефиксом);
	Запрос.УстановитьПараметр("Артикул", Артикул);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() И Выборка.Ссылка <> NULL Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Справочники.Номенклатура.ПустаяСсылка();
	
КонецФункции

&НаСервере
Функция НайтиСериюНоменклатуры(Номенклатура, СерияПоДаннымСклада)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Данные.Ссылка КАК Ссылка,
	|	Данные.Приоритет КАК Приоритет
	|ИЗ
	|	(ВЫБРАТЬ
	|		СерииНоменклатуры.Ссылка КАК Ссылка,
	|		1 КАК Приоритет
	|	ИЗ
	|		Справочник.СерииНоменклатуры КАК СерииНоменклатуры
	|	ГДЕ
	|		СерииНоменклатуры.Наименование = &Наименование
	|		И СерииНоменклатуры.ВидНоменклатуры = &ВидНоменклатуры
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		СерииНоменклатуры.Ссылка,
	|		2
	|	ИЗ
	|		Справочник.СерииНоменклатуры КАК СерииНоменклатуры
	|	ГДЕ
	|		СерииНоменклатуры.Номер = &Номер
	|		И СерииНоменклатуры.ВидНоменклатуры = &ВидНоменклатуры
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		СерииНоменклатуры.Ссылка,
	|		3
	|	ИЗ
	|		Справочник.СерииНоменклатуры КАК СерииНоменклатуры
	|	ГДЕ
	|		СерииНоменклатуры.Номер = &НомБезДаты
	|		И СерииНоменклатуры.ВидНоменклатуры = &ВидНоменклатуры) КАК Данные
	|
	|УПОРЯДОЧИТЬ ПО
	|	Приоритет";
	Запрос.УстановитьПараметр("Наименование", СерияПоДаннымСклада);
	Запрос.УстановитьПараметр("ВидНоменклатуры", ПолучитьВладельцаСерий(Номенклатура));
	
	МассивНомеров = СтрРазделить(СерияПоДаннымСклада, ",", Истина);
	Запрос.УстановитьПараметр("Номер", МассивНомеров[0]);
	Запрос.УстановитьПараметр("НомБезДаты", МассивНомеров[0]);
	
	Если МассивНомеров.Количество() > 1 Тогда
		
		ДатаСерии = СтроковыеФункцииКлиентСервер.СтрокаВДату(СокрЛП(МассивНомеров[1]));
		Если ЗначениеЗаполнено(ДатаСерии) Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "СерииНоменклатуры.Номер = &Номер",
													 "СерииНоменклатуры.Номер = &Номер И СерииНоменклатуры.ГоденДо = &Дата");
			Запрос.УстановитьПараметр("Дата", ДатаСерии);
		КонецЕсли;
		
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Справочники.СерииНоменклатуры.ПустаяСсылка();
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьВладельцаСерий(Номенклатура)
	
	ДанныеНоменклатуры = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Номенклатура, "ВидНоменклатуры, ВидНоменклатуры.ВладелецСерий");
	Если ЗначениеЗаполнено(ДанныеНоменклатуры.ВидНоменклатурыВладелецСерий) Тогда
		Возврат ДанныеНоменклатуры.ВидНоменклатурыВладелецСерий;
	Иначе
		Возврат ДанныеНоменклатуры.ВидНоменклатуры;
	КонецЕсли;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьУчетноеКоличество(НомерСтроки = Неопределено)
	
	//удаляем все что не из файла
	НайденныеСтроки = Объект.Товары.НайтиСтроки(Новый Структура("АртикулКодПоДаннымСклада", ""));
	Для каждого стрНайденнаяСтрока Из НайденныеСтроки Цикл
		Объект.Товары.Удалить(стрНайденнаяСтрока);
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ВидыНоменклатурыССериями", ПолучитьМассивВидовНоменклатурыСУчетомПоСериям());
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Т.Номенклатура КАК Номенклатура,
	|	Т.Серия КАК Серия,
	|	Т.НомерСтроки КАК НомерСтроки
	|ПОМЕСТИТЬ ВТНоменклатура
	|ИЗ
	|	&ТЗ КАК Т
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Т.Номенклатура КАК Номенклатура,
	|	ВЫБОР
	|		КОГДА Т.Номенклатура.ВидНоменклатуры В (&ВидыНоменклатурыССериями)
	|			ТОГДА Т.Серия
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)
	|	КОНЕЦ КАК Серия,
	|	СУММА(Т.ВНаличииОстаток) КАК Количество
	|ПОМЕСТИТЬ ВТОстатки
	|ИЗ
	|	РегистрНакопления.ТоварыНаСкладах.Остатки(&ДатаОстатков, Склад = &Склад) КАК Т
	|
	|СГРУППИРОВАТЬ ПО
	|	ВЫБОР
	|		КОГДА Т.Номенклатура.ВидНоменклатуры В (&ВидыНоменклатурыССериями)
	|			ТОГДА Т.Серия
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)
	|	КОНЕЦ,
	|	Т.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТНоменклатура.Номенклатура КАК Номенклатура,
	|	ВТНоменклатура.Серия КАК Серия,
	|	ВТНоменклатура.НомерСтроки КАК НомерСтроки,
	|	ЕСТЬNULL(ВТОстатки.Количество, 0) КАК Количество
	|ИЗ
	|	ВТНоменклатура КАК ВТНоменклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОстатки КАК ВТОстатки
	|		ПО ВТНоменклатура.Номенклатура = ВТОстатки.Номенклатура
	|			И ВТНоменклатура.Серия = ВТОстатки.Серия
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТОстатки.Номенклатура,
	|	ВТОстатки.Серия,
	|	-1,
	|	ВТОстатки.Количество
	|ИЗ
	|	ВТОстатки КАК ВТОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТНоменклатура КАК ВТНоменклатура
	|		ПО ВТОстатки.Номенклатура = ВТНоменклатура.Номенклатура
	|			И ВТОстатки.Серия = ВТНоменклатура.Серия
	|ГДЕ
	|	ВТНоменклатура.НомерСтроки ЕСТЬ NULL
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	Запрос.УстановитьПараметр("ДатаОстатков", Новый Граница(КонецДня(Объект.Дата), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("Склад", Объект.Склад);
	Запрос.УстановитьПараметр("ТЗ", Объект.Товары.Выгрузить(, "НомерСтроки, Номенклатура, Серия"));
	
	Если НЕ НомерСтроки = Неопределено Тогда
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ТЗ КАК Т", "&ТЗ КАК Т
															  |ГДЕ
															  |	Т.НомерСтроки = &НомерСтроки");
		Запрос.УстановитьПараметр("НомерСтроки", НомерСтроки);
		
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.НомерСтроки <> -1 Тогда
			
			стрТовары = Объект.Товары[Выборка.НомерСтроки - 1];
			стрТовары.КоличествоУчет = Выборка.Количество;
			Если стрТовары.КоличествоУчет <> стрТовары.КоличествоФакт Тогда
				стрТовары.ЕстьРасхождения = Истина;
			Иначе
				стрТовары.ЕстьРасхождения = Ложь;
			КонецЕсли;
			
		Иначе
			
			стрТовары = Объект.Товары.Добавить();
			ЗаполнитьЗначенияСвойств(стрТовары, Выборка, "Номенклатура,Серия");
			стрТовары.КоличествоУчет = Выборка.Количество;
			стрТовары.ЕстьРасхождения = Истина;
			
		КонецЕсли;
		
	КонецЦикла;
	
	РассчитатьИтоги();
	Модифицированность = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьИнформациюОРасхожденииПоСтрокамДокумента()
	
	Для каждого стрТовары Из Объект.Товары Цикл
		стрТовары.ЕстьРасхождения = стрТовары.КоличествоУчет <> стрТовары.КоличествоФакт;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьОчиститьСерию(ИДСтроки)
	
	ТекущаяСтрока = Объект.Товары.НайтиПоИдентификатору(ИДСтроки);
	Если ТекущаяСтрока.Серия.ВидНоменклатуры <> ПолучитьВладельцаСерий(ТекущаяСтрока.Номенклатура) Тогда
		ТекущаяСтрока.Серия = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура РассчитатьИтоги()
	
	ТЗТовары = Объект.Товары.Выгрузить(Новый Структура("Исключить", Ложь));
	ИтогоУчетноеКоличество = ТЗТовары.Итог("КоличествоУчет");
	ИтогоФактическоеКоличество = ТЗТовары.Итог("КоличествоФакт");
	
	Объект.ЕстьРасхождение = Ложь;
	Для каждого стрТовары Из Объект.Товары Цикл
		Если стрТовары.КоличествоУчет <> стрТовары.КоличествоФакт И НЕ стрТовары.Исключить Тогда
			Объект.ЕстьРасхождение = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если Объект.ЕстьРасхождение Тогда
		ИнформацияОРасхождении = "Есть расхождение";
	Иначе
		ИнформацияОРасхождении = "Расхождения нет";
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборТабличнойЧастиТовары()
	
	СтруктураОтбора = Новый Структура;
	
	Если Элементы.ТоварыПоказыватьТолькоРасхождения.Пометка Тогда
		СтруктураОтбора.Вставить("ЕстьРасхождения", Истина);
	КонецЕсли;
	
	Если НЕ Элементы.ТоварыПоказыватьИсключенные.Пометка Тогда
		СтруктураОтбора.Вставить("Исключить", Ложь);
	КонецЕсли;
	
	Если СтруктураОтбора.Количество() > 0 Тогда
		Элементы.Товары.ОтборСтрок = Новый ФиксированнаяСтруктура(СтруктураОтбора);
	Иначе
		Элементы.Товары.ОтборСтрок = Неопределено;
	КонецЕсли;
	
	Элементы.Товары.Обновить();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьМассивВидовНоменклатурыСУчетомПоСериям()
	
	МассивВидовНоменклатуры = Новый Массив;
	МассивВидовНоменклатуры.Добавить(Справочники.ВидыНоменклатуры.НайтиПоНаименованию("ТоварПлоттерыСерии"));
	
	Возврат МассивВидовНоменклатуры;
	
КонецФункции

&НаСервере
Процедура ЗагрузитьДанныеССервераАдмиралНаСервере()
	
	Объект.Товары.Очистить();
	
	ТЗСайта = ПолучитьТаблицуДляЗагрузкиДанных();
	
	ПолученныеДанные = смартИнтеграцияСАдмирал.ПолучитьОстаткиАдмирал(Объект.Дата + 86400,, (Объект.Склад = Справочники.смартПредопределенныеЗначения.СкладАдмиралКовчег.Значение));
	Если ТипЗнч(ПолученныеДанные) = Тип("Структура") Тогда
		
		Для каждого стрТовары Из ПолученныеДанные.goods Цикл
			
			НоваяСтрока = ТЗСайта.Добавить();
			
			НоваяСтрока.АртикулКодПоДаннымСклада = стрТовары.product_id_ext;
			НоваяСтрока.НоменклатураПоДаннымСклада = стрТовары.product_name;
			НоваяСтрока.СерияПоДаннымСклада = стрТовары.serial;
			НоваяСтрока.КоличествоФакт = стрТовары.quantity;
											 
		КонецЦикла;
		
	КонецЕсли;
	
	ЗагрузитьДанныеОбработатьПолученнуюТаблицу(ТЗсайта);
	
КонецПроцедуры

#КонецОбласти
